src/test/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
                  xmlns:gs="http://fchc.jz.pl/kraj/web-service">
    <soapenv:Header/>
    <soapenv:Body>
        <gs:getCountryRequest>
            <gs:name>Poland</gs:name>
        </gs:getCountryRequest>
    </soapenv:Body>
</soapenv:Envelope>